veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxMinimcds_reg.h
/** \brief A30, Counter Control Register */
#define MINIMCDS_MCX_CNT3_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_CCL*)0xFB718A30u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT3_CCL.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT3_CCL.
*/
#define MINIMCDS_MCXCCL3 (MINIMCDS_MCX_CNT3_CCL)

/** \brief A34, Counter Limit Register */
#define MINIMCDS_MCX_CNT3_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_LMT*)0xFB718A34u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT3_LMT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT3_LMT.
*/
#define MINIMCDS_MCXLMT3 (MINIMCDS_MCX_CNT3_LMT)

/** \brief A38, Current Count Register */
#define MINIMCDS_MCX_CNT3_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_CNT*)0xFB718A38u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT3_CNT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT3_CNT.
*/
#define MINIMCDS_MCXCNT3 (MINIMCDS_MCX_CNT3_CNT)

/** \brief A40, Counter Control Register */
#define MINIMCDS_MCX_CNT4_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_CCL*)0xFB718A40u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT4_CCL.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT4_CCL.
*/
#define MINIMCDS_MCXCCL4 (MINIMCDS_MCX_CNT4_CCL)

/** \brief A44, Counter Limit Register */
#define MINIMCDS_MCX_CNT4_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_LMT*)0xFB718A44u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT4_LMT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT4_LMT.
*/
#define MINIMCDS_MCXLMT4 (MINIMCDS_MCX_CNT4_LMT)

/** \brief A48, Current Count Register */
#define MINIMCDS_MCX_CNT4_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_CNT*)0xFB718A48u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT4_CNT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT4_CNT.
*/
#define MINIMCDS_MCXCNT4 (MINIMCDS_MCX_CNT4_CNT)

/** \brief A50, Counter Control Register */
#define MINIMCDS_MCX_CNT5_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_CCL*)0xFB718A50u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT5_CCL.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT5_CCL.
*/
#define MINIMCDS_MCXCCL5 (MINIMCDS_MCX_CNT5_CCL)

/** \brief A54, Counter Limit Register */
#define MINIMCDS_MCX_CNT5_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_LMT*)0xFB718A54u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT5_LMT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT5_LMT.
*/
#define MINIMCDS_MCXLMT5 (MINIMCDS_MCX_CNT5_LMT)

/** \brief A58, Current Count Register */
#define MINIMCDS_MCX_CNT5_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_CNT*)0xFB718A58u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT5_CNT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT5_CNT.
*/
#define MINIMCDS_MCXCNT5 (MINIMCDS_MCX_CNT5_CNT)

/** \brief A60, Counter Control Register */
#define MINIMCDS_MCX_CNT6_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_CCL*)0xFB718A60u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT6_CCL.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT6_CCL.
*/
#define MINIMCDS_MCXCCL6 (MINIMCDS_MCX_CNT6_CCL)

/** \brief A64, Counter Limit Register */
#define MINIMCDS_MCX_CNT6_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_LMT*)0xFB718A64u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT6_LMT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT6_LMT.
*/
#define MINIMCDS_MCXLMT6 (MINIMCDS_MCX_CNT6_LMT)

/** \brief A68, Current Count Register */
#define MINIMCDS_MCX_CNT6_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_CNT*)0xFB718A68u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT6_CNT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT6_CNT.
*/
#define MINIMCDS_MCXCNT6 (MINIMCDS_MCX_CNT6_CNT)

/** \brief A70, Counter Control Register */
#define MINIMCDS_MCX_CNT7_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_CCL*)0xFB718A70u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT7_CCL.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT7_CCL.
*/
#define MINIMCDS_MCXCCL7 (MINIMCDS_MCX_CNT7_CCL)

/** \brief A74, Counter Limit Register */
#define MINIMCDS_MCX_CNT7_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_LMT*)0xFB718A74u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT7_LMT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT7_LMT.
*/
#define MINIMCDS_MCXLMT7 (MINIMCDS_MCX_CNT7_LMT)

/** \brief A78, Current Count Register */
#define MINIMCDS_MCX_CNT7_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_CNT*)0xFB718A78u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT7_CNT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT7_CNT.
*/
#define MINIMCDS_MCXCNT7 (MINIMCDS_MCX_CNT7_CNT)

/** \brief 2000, Debug Status Register */
#define MINIMCDS_TCX_DCSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_TCX_DCSTS*)0xFB71A000u)
/** Alias (User Manual Name) for MINIMCDS_TCX_DCSTS.
* To use register names with standard convension, please use MINIMCDS_TCX_DCSTS.
*/
#define MINIMCDS_TCXDCSTS (MINIMCDS_TCX_DCSTS)

/** \brief 2008, Current Instruction Pointer */
#define MINIMCDS_TCX_CIP /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_TCX_CIP*)0xFB71A008u)
/** Alias (User Manual Name) for MINIMCDS_TCX_CIP.
* To use register names with standard convension, please use MINIMCDS_TCX_CIP.
*/
#define MINIMCDS_TCXCIP (MINIMCDS_TCX_CIP)

/** \brief 200C, Compact Function Trace Register */
#define MINIMCDS_TCX_CFT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_TCX_CFT*)0xFB71A00Cu)
/** Alias (User Manual Name) for MINIMCDS_TCX_CFT.
* To use register names with standard convension, please use MINIMCDS_TCX_CFT.
*/
#define MINIMCDS_TCXCFT (MINIMCDS_TCX_CFT)

/** \brief 2400, Comparator Bound Register 0 */
#define MINIMCDS_TCX_EA0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_TCX_EA_BND*)0xFB71A400u)
/** Alias (User Manual Name) for MINIMCDS_TCX_EA0_BND.
* To use register names with standard convension, please use MINIMCDS_TCX_EA0_BND.
*/
#define MINIMCDS_TCXEABND0 (MINIMCDS_TCX_EA0_BND)

/** \brief 2404, Comparator Range Register 0 */
#define MINIMCDS_TCX_EA0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_TCX_EA_RNG*)0xFB71A404u)
/** Alias (User Manual Name) for MINIMCDS_TCX_EA0_RNG.
* To use register names with standard convension, please use MINIMCDS_TCX_EA0_RNG.
*/
#define MINIMCDS_TCXEARNG0 (MINIMCDS_TCX_EA0_RNG)

